
def _conv_dict():

    dic_str = """
	あいうえおアイウエオ
k	かきくけこカキクケコ
s	さしすせそサシスセソ
t	たちつてとタチツテト
n	なにぬねのナニヌネノ
h	はひふへほハヒフヘホ
m	まみむめもマミムメモ
y	や𛀆ゆ𛀁よヤ𛄠ユ𛄡ヨ
r	らりるれろラリルレロ
w	わゐ𛄟ゑをワヰ𛄢ヱヲ
g	がぎぐげごガギグゲゴ
z	ざじずぜぞザジズゼゾ
d	だぢづでどダヂヅデド
b	ばびぶべぼバビブベボ
p	ぱぴぷぺぽパピプペポ
′	ぁぃぅぇぉァィゥェォ
v	ゎ𛅐𛄟𛅑𛅒ヮ𛅤𛄢𛅥𛅦
j	ゃ_ゅ_ょャ_ュ_ョ
"""

    vows = "aiueoaiueo"
    dic = [row.split('	') for row in dic_str.split('\n') if row]
    dic = {kana : f'{con}{vow}' for con, kanas in dic for kana, vow in zip(kanas, vows) if kana and kana != '_'}

    dic2 = {
    'n' : 'ん',    'n' : '𛅧',    '‵' : 'っ',    'ka' : 'ヵ',
    'n' : 'ン',    'n' : '𛅧',    '‵' : 'ッ',    'ka' : 'ヶ',
    'ー' : '꞉',
    }
    dic.update(dic2)

    return dic

conv_dict = {'あ': 'a', 'い': 'i', 'う': 'u', 'え': 'e', 'お': 'o', 'ア': 'a', 'イ': 'i', 'ウ': 'u', 'エ': 'e', 'オ': 'o', 'か': 'ka', 'き': 'ki', 'く': 'ku', 'け': 'ke', 'こ': 'ko', 'カ': 'ka', 'キ': 'ki', 'ク': 'ku', 'ケ': 'ke', 'コ': 'ko', 'さ': 'sa', 'し': 'si', 'す': 'su', 'せ': 'se', 'そ': 'so', 'サ': 'sa', 'シ': 'si', 'ス': 'su', 'セ': 'se', 'ソ': 'so', 'た': 'ta', 'ち': 'ti', 'つ': 'tu', 'て': 'te', 'と': 'to', 'タ': 'ta', 'チ': 'ti', 'ツ': 'tu', 'テ': 'te', 'ト': 'to', 'な': 'na', 'に': 'ni', 'ぬ': 'nu', 'ね': 'ne', 'の': 'no', 'ナ': 'na', 'ニ': 'ni', 'ヌ': 'nu', 'ネ': 'ne', 'ノ': 'no', 'は': 'ha', 'ひ': 'hi', 'ふ': 'hu', 'へ': 'he', 'ほ': 'ho', 'ハ': 'ha', 'ヒ': 'hi', 'フ': 'hu', 'ヘ': 'he', 'ホ': 'ho', 'ま': 'ma', 'み': 'mi', 'む': 'mu', 'め': 'me', 'も': 'mo', 'マ': 'ma', 'ミ': 'mi', 'ム': 'mu', 'メ': 'me', 'モ': 'mo', 'や': 'ya', '𛀆': 'yi', 'ゆ': 'yu', '𛀁': 'ye', 'よ': 'yo', 'ヤ': 'ya', '𛄠': 'yi', 'ユ': 'yu', '𛄡': 'ye', 'ヨ': 'yo', 'ら': 'ra', 'り': 'ri', 'る': 'ru', 'れ': 're', 'ろ': 'ro', 'ラ': 'ra', 'リ': 'ri', 'ル': 'ru', 'レ': 're', 'ロ': 'ro', 'わ': 'wa', 'ゐ': 'wi', '𛄟': 'vu', 'ゑ': 'we', 'を': 'wo', 'ワ': 'wa', 'ヰ': 'wi', '𛄢': 'vu', 'ヱ': 'we', 'ヲ': 'wo', 'が': 'ga', 'ぎ': 'gi', 'ぐ': 'gu', 'げ': 'ge', 'ご': 'go', 'ガ': 'ga', 'ギ': 'gi', 'グ': 'gu', 'ゲ': 'ge', 'ゴ': 'go', 'ざ': 'za', 'じ': 'zi', 'ず': 'zu', 'ぜ': 'ze', 'ぞ': 'zo', 'ザ': 'za', 'ジ': 'zi', 'ズ': 'zu', 'ゼ': 'ze', 'ゾ': 'zo', 'だ': 'da', 'ぢ': 'di', 'づ': 'du', 'で': 'de', 'ど': 'do', 'ダ': 'da', 'ヂ': 'di', 'ヅ': 'du', 'デ': 'de', 'ド': 'do', 'ば': 'ba', 'び': 'bi', 'ぶ': 'bu', 'べ': 'be', 'ぼ': 'bo', 'バ': 'ba', 'ビ': 'bi', 'ブ': 'bu', 'ベ': 'be', 'ボ': 'bo', 'ぱ': 'pa', 'ぴ': 'pi', 'ぷ': 'pu', 'ぺ': 'pe', 'ぽ': 'po', 'パ': 'pa', 'ピ': 'pi', 'プ': 'pu', 'ペ': 'pe', 'ポ': 'po', 'ぁ': '′a', 'ぃ': '′i', 'ぅ': '′u', 'ぇ': '′e', 'ぉ': '′o', 'ァ': '′a', 'ィ': '′i', 'ゥ': '′u', 'ェ': '′e', 'ォ': '′o', 'ゎ': 'va', '𛅐': 'vi', '𛅑': 've', '𛅒': 'vo', 'ヮ': 'va', '𛅤': 'vi', '𛅥': 've', '𛅦': 'vo', 'ゃ': 'ja', 'ゅ': 'ju', 'ょ': 'jo', 'ャ': 'ja', 'ュ': 'ju', 'ョ': 'jo', 'n': '𛅧', '‵': 'ッ', 'ka': 'ヶ', 'ー' : '꞉',}




